# Run brew bundle

# 'brew tap'
# tap "federico-terzi/espanso"
#tap "homebrew/core"
#tap "homebrew/bundle"
#tap "homebrew/cask"
#tap "homebrew/cask-fonts"
#tap "homebrew/cask-versions"
#tap "homebrew/services"

# 'brew install'
# brew "docker"
# brew "docker-compose"
# brew "podman"
# brew "podman-compose"

brew "asdf"
# brew "aws-vault"
brew "awscli"
# brew "coreutils"
brew "direnv"
# brew "fzf"
brew "gh"
brew "httpie"
brew "jq"
brew "lazydocker"
brew "lazygit"
# brew "lf"
# brew "mas"
brew "navi"
brew "neovim"
# brew "reattach-to-user-namespace"
# brew "terminal-notifier"
brew "thefuck"
brew "tmux"
# brew "watch"
brew "wget"

# cat
brew "bat"
# top
brew "bottom"
#du
brew "dust"
# ls
brew "eza"
# find
brew "fd"
# git diff
brew "git-delta"
# reverse search
brew "mcfly"
# ps
brew "procs"
# grep
brew "ripgrep"
# tldr
brew "tealdeer"
# cd
brew "zoxide"


# 'brew install --cask <package>'

# cask "alfred"
cask "raycast"

# cask "alacritty"
# cask "iterm2"
cask "kitty"

# cask "flycut"
cask "maccy"

# cask "insomnia"
# cask "postman"

cask "craft"
# cask "notion"

# cask "appcleaner"
cask "brave-browser"
# cask "bitwarden"
# cask "clocker"
cask "cron"
cask "datagrip"
cask "discord"
cask "docker"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "github"
cask "google-chrome"
cash "hiddenbar"
# cask "keka"
# cask "kekaexternalhelper"
cask "meetingbar"
# cask "iina"
# cask "itsycal"
# cask "openwebstart"  #support old version java
cask "rectangle"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "stats"
# cask "steam"
cask "telegram"
cask "vincelwt-chatgpt"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

# 'mas install'
# mas "Tailscale", id: 1475387142
# mas "befocused"
# mas "dropover"
# mas "dato"
