# brew => 'brew install <package>'
# cask => 'brew install --cask <package>'
# mas => 'mas install <package>'

# brew "docker"
# cask "docker"
# brew "docker-buildx"
# brew "docker-compose"

# brew "podman"
# brew "podman-compose"
# cask "podman-desktop"

# brew zsh-autosuggestions
# brew zsh-autocomplete
# brew zsh-syntax-highlighting

brew "asdf"
# brew "aws-vault"
brew "awscli"
# brew "coreutils"
brew "direnv"
brew "fzf"
brew "gh"
#brew "httpie"
brew "jq"
brew "lazydocker"
brew "lazygit"
# brew "mas"
# brew "navi"
brew "neovim"
# brew "reattach-to-user-namespace"
# brew "terminal-notifier"
# brew "thefuck"
brew "tmux"
# brew "watch"
brew "wget"

## cat
brew "bat"
## top
# brew "bottom"
## du
# brew "dust"
## ls
brew "eza"
## find
brew "fd"
## git diff
brew "git-delta"
## reverse search
brew "mcfly"
## ps
# brew "procs"
## grep
brew "ripgrep"
## tldr
brew "tealdeer"
## cd
brew "zoxide"

# cask "alfred"
# cask "monarch"
cask "raycast"

## Terminal
# cask "alacritty"
# cask "iterm2"
# cask "kitty"
# cask "warp"
# cask "wezterm"
cask "ghostty"

# cask "flycut"
cask "maccy"

# cask "insomnia"
# cask "postman"
cask "hoppscotch"

# cask "craft"
# cask "notion"

# cask "sublime-text"
cask "zed"

cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# cask "gitkraken"
# cask "fork"
cask "github"

# cask "itsycal"
# mas "dato"
cask "meetingbar"

cask "aldente"
# cask "appcleaner"
cask "brave-browser"
# cask "bitwarden"
cask "chatgpt"
# cask "clocker"
# cask "cron"
cask "datagrip"
# cask "discord"
cask "espanso"
cask "google-chrome"
cash "hiddenbar"
cask "keka"
# cask "kekaexternalhelper"
# cask "iina"
# cask "openwebstart"  #support old version java
# cask "rectangle"
cask "slack"
cask "spotify"
# cask "stats"
# cask "steam"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"


# mas "Tailscale", id: 1475387142
# mas "befocused"
# mas "dropover"

