djui/alias-tips

# Robbyrussell plugins
#robbyrussell/oh-my-zsh folder:plugins/git
robbyrussell/oh-my-zsh folder:plugins/autojump
#robbyrussell/oh-my-zsh folder:plugins/ssh-agent
jeffreytse/zsh-vi-mode


# ohmyzsh plugins
ohmyzsh/ohmyzsh path:plugins/aws
#ohmyzsh/ohmyzsh path:plugins/asdf


# these should be at last!
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search



